phrase = {
    'error': (
        'Какая-то ошибка, попробуй так.',
        'Не понимаю, напиши как в примере.',
        'Какой-то сумбур! Перед использованием нужно прочесть как пользоваться, смотри как нужно.',
        'Так я не разберу, что требуется. Отправь сообщение как в примере.',
        'Не понимаю, что от меня требуется. Смотри пример ниже.'
    ),
    'help': (
        '-5.89 K -> вернёт <-200°C (тип K)>\n-5mv K -> вернёт <-153.736°C (тип K)>\n-200 K -> вернёт <-5.89mV (тип К)>\n-200.0t K -> вернёт <-5.89mV (тип К)>',
        '74,60 100M -> вернёт <-58.9°C (тип Cu85)>\n74r 100M  -> вернёт <-60.2°C (тип Cu85)>\n115 50M -> вернёт <74,60Ом (тип Cu85)>\n115.0t 50M -> вернёт <74,60Ом (тип Cu85)>'
    )
}






