phrase = {
    'error': (
        'Какая-то ошибка, попробуй так.',
        'Не понимаю, напиши как в примере.',
        'Какой-то сумбур! не понимаю. Смотри как нужно.',
        'Так я не разберу, что требуется. Отправь сообщение как в примере.',
        'Не понимаю, что от меня требуется. Смотри пример ниже.'
    ),
    'main_help': ('По умолчанию коэффициент α:\nМедные(Cu) - 0.00428\nПлатиновые(Pt) - 0.00391\nНикелевые(Ni) - 0.00617\n\n\
Если необходимо изменить эту характеристику, то добавь требуемое значение в конце сообщения, через пробел.Например так:\n\n\
-50 100M 426 --> вернёт <78.70 Ом(Cu426)>\n\nДопустимые значения для: медных - 426 и 428, платиновых - 385 и 391, никелевых - 617'),
    'help': (
        '-5.89 K -> вернёт <-200°C (тип K)>\n-5mv K -> вернёт <-153.736°C (тип K)>\n-200 K -> вернёт <-5.89mV (тип К)>\n-200.0t K -> вернёт <-5.89mV (тип К)>\n',
        '74,60 100M -> вернёт <-58.9°C (тип Cu85)>\n74r 100M  -> вернёт <-60.2°C (тип Cu85)>\n115 50M -> вернёт <74,60Ом (тип Cu85)>\n115.0t 50M -> вернёт <74,60Ом (тип Cu85)>\n'
    )
}
